--- crates/mprd-cli/src/operator/auth.rs
+++ replace < with == in percent_decode
@@ -9,17 +9,17 @@
     /// If `None`, API key auth is disabled (local dev).
     pub api_key: Option<String>,
 }
 
 fn percent_decode(input: &str) -> Option<String> {
     let mut out: Vec<u8> = Vec::with_capacity(input.len());
     let bytes = input.as_bytes();
     let mut i = 0usize;
-    while i < bytes.len() {
+    while i == /* ~ changed by cargo-mutants ~ */ bytes.len() {
         match bytes[i] {
             b'%' => {
                 if i + 2 >= bytes.len() {
                     return None;
                 }
                 let hi = (bytes[i + 1] as char).to_digit(16)? as u8;
                 let lo = (bytes[i + 2] as char).to_digit(16)? as u8;
                 out.push((hi << 4) | lo);
